<a href="https://colab.research.google.com/github/Eunjung-Cho/python_study/blob/master/Preprocessing/%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%B2%98%EB%A6%AC%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D/%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84%EB%8B%A4%EB%A3%A8%EA%B8%B0_%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = [1, 2, 3, 4])

In [ ]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df2 = pd.DataFrame(
        [[4, 7, 10], [5, 8, 11], [6, 9, 12], [6, 9, 12]], 
        index=[1, 2, 3, 4], 
        columns=['a', 'b', 'c']) 
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df3 = df2.T
df3

    1   2   3   4
a   4   5   6   6
b   7   8   9   9
c  10  11  12  12

In [ ]:
df3.columns = ['a', 'b', 'c', 'd']
df3

    a   b   c   d
a   4   5   6   6
b   7   8   9   9
c  10  11  12  12

In [ ]:
df3.index = [11, 22, 33]
df3

     a   b   c   d
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [ ]:
df33 = df3.rename(columns = {'a':'A', 'b':'B', 'c':'C', 'd':'D'})
df33

     A   B   C   D
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

### 비교연산자를 이용한 조회

In [ ]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df.b>7

1    False
2     True
3     True
4     True
Name: b, dtype: bool

In [ ]:
df[df.b>7]

   a  b   c
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df[df.c>7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df[df['c']>7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

* 열 이름이 한글이나 특수문자 있는 경우 df['열이름']

In [ ]:
df[df['c'] == 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [ ]:
df[df['c']>=7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df["b"] !=7

1    False
2     True
3     True
4     True
Name: b, dtype: bool

In [ ]:
df[df["b"] !=7]

   a  b   c
2  5  8  11
3  6  9  12
4  6  9  12

* 큰 따옴표, 작은 따옴표 동일하게 인식

### 중복 행 제거하는 drop_duplicates( )

In [ ]:
# 도움말 보기
df.drop_duplicates?

In [ ]:
df

In [ ]:
df.drop_duplicates()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [ ]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

* 변수에 담지 않아서 중복 행 제거한 결과가 원본 df에 반영 안됨

In [ ]:
df.drop_duplicates()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [ ]:
df.drop_duplicates?

In [ ]:
df.drop_duplicates(inplace = True)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

* inplace = True 옵션은 원본에 바로 적용시키라는 뜻의 옵션
* Pandas에서는 drop_duplicates(inplace = True)를 비추함
* 대신 df = df.drop_duplicates() 이런 형식을 권장

In [ ]:
df = df2

In [ ]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [ ]:
df.drop_duplicates(keep='first')

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [ ]:
df.drop_duplicates(keep='last')

   a  b   c
1  4  7  10
2  5  8  11
4  6  9  12

In [ ]:
df = df.drop_duplicates(keep='first')
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [ ]:
df = df.drop_duplicates(keep='last')
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

### 특정값, null값 조회
#### 특정값을 조회하는 isin( )

In [ ]:
# df.column.isin(values) 
df.a.isin?

In [ ]:
df.a.isin(5)

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

* 특정값이 있나 확인하는 isin, 특정값은 리스트 형태로 써야 함

In [ ]:
df.a.isin([5])

1    False
2     True
3    False
Name: a, dtype: bool

In [ ]:
df[df.a.isin([5])]

   a  b   c
2  5  8  11

In [ ]:
df.a.isin([5, 6])

1    False
2     True
3     True
Name: a, dtype: bool

In [ ]:
df['a'].isin([5, 6])

1    False
2     True
3     True
Name: a, dtype: bool

* 주의! 열의 이름이 한글, 특수문자 등이 있다면 반드시 ['열이름'] 형태로 기입해야 함

#### null값 조회하는 isnull( )

In [ ]:
df.isnull( )

In [ ]:
pd.isnull(df)

       a      b      c
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9 ,9],
        "c" : [10, 11, 12, 12]},
        index = [1, 2, 3, 4, 5])
df4

In [ ]:
import numpy as np
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = [1, 2, 3, 4, 5])
df4

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [ ]:
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = [1, 2, 3, 4, 5], dtype = int)
df4

     a    b    c
1    4    7   10
2    5    8   11
3    6  NaN   12
4    6    9  NaN
5  NaN    9   12

In [ ]:
df.dtypes

a    int64
b    int64
c    int64
dtype: object

In [ ]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [ ]:
pd.isnull(df4)

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [ ]:
df4.isnull()

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [ ]:
df4['a'].isnull()

1    False
2    False
3    False
4    False
5     True
Name: a, dtype: bool

In [ ]:
df4['a'].isnull().sum()

1

* 'a'열의 null값 즉, 비어있는값 이 총 몇 개인지 알려줌

#### notnull과 ~notnull

In [ ]:
pd.notnull(df4)

       a      b      c
1   True   True   True
2   True   True   True
3   True  False   True
4   True   True  False
5  False   True   True

In [ ]:
df4.notnull()

In [ ]:
df4.notnull().sum()

a    4
b    4
c    4
dtype: int64

* notnull의 총 개수를 알려 줌

In [ ]:
df4.a.notnull()

1     True
2     True
3     True
4     True
5    False
Name: a, dtype: bool

In [ ]:
df4['a'].notnull()

1     True
2     True
3     True
4     True
5    False
Name: a, dtype: bool

In [ ]:
~df4.a.notnull()

1    False
2    False
3    False
4    False
5     True
Name: a, dtype: bool

### 논리 연산자를 이용한 조회

In [ ]:
True and False

False

In [ ]:
True or False

In [ ]:
df4

     a    b    c
1    4    7   10
2    5    8   11
3    6  NaN   12
4    6    9  NaN
5  NaN    9   12

In [ ]:
df4[df4.b == 7] & df4[df4.a == 4]

   a  b   c
1  4  7  10

In [ ]:
df4[df4.b == 7] | df4[df4.a == 4]

   a  b   c
1  4  7  10

In [ ]:
df4[df4.b == 9] | df4[df4.a == 6]

In [ ]:
df4[df4.b == 9]

     a  b    c
4    6  9  NaN
5  NaN  9   12

In [ ]:
df4[df4.a == 6]

   a    b    c
3  6  NaN   12
4  6    9  NaN

In [ ]:
df4[(df4.b == 9) & (df4.a == 6)]

In [ ]:
df4[(df4.b == 9) | (df4.a == 6)]

#### 기초적 통계 관련

In [ ]:
df4.nlargest?

In [ ]:
df5 = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                   434000, 434000, 337000, 11300,
                                   11300, 11300],
                    'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                            17036, 182, 38, 311],
                    'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                                "IS", "NR", "TV", "AI"]},
                   index=["Italy", "France", "Malta",
                          "Maldives", "Brunei", "Iceland",
                          "Nauru", "Tuvalu", "Anguilla"])
df5

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [ ]:
df5.nlargest(3, 'population')

In [ ]:
df5.nsmallest(3, 'population')

In [ ]:
df5.describe()

         population           GDP
count  9.000000e+00  9.000000e+00
mean   1.396366e+07  5.075200e+05
std    2.727596e+07  1.007015e+06
min    1.130000e+04  3.800000e+01
25%    1.130000e+04  3.110000e+02
50%    4.340000e+05  1.201100e+04
75%    4.340000e+05  1.703600e+04
max    6.500000e+07  2.583560e+06

In [ ]:
df5['population'].count()

In [ ]:
df5['population'].mean()

In [ ]:
df5['population'].median()

In [ ]:
df5['population'].max()

In [ ]:
df5['population'].min()

In [ ]:
df5.sample(n=5)

In [ ]:
df5.sample(frac=1)

          population      GDP alpha-2
Italy       59000000  1937894      IT
Tuvalu         11300       38      TV
France      65000000  2583560      FR
Brunei        434000    12128      BN
Malta         434000    12011      MT
Iceland       337000    17036      IS
Anguilla       11300      311      AI
Nauru          11300      182      NR
Maldives      434000     4520      MV

In [ ]:
df5['population'] > df5['population'].mean()

Italy        True
France       True
Malta       False
Maldives    False
Brunei      False
Iceland     False
Nauru       False
Tuvalu      False
Anguilla    False
Name: population, dtype: bool

In [ ]:
df5[df5['population'] > df5['population'].mean()]

        population      GDP alpha-2
Italy     59000000  1937894      IT
France    65000000  2583560      FR

### 불린기반 조회, 열 연산, 브로드캐스팅, 인덱스기준 정렬

In [ ]:
df5.loc[[True, False, False, False, True, True, False, True, True]]

          population      GDP alpha-2
Italy       59000000  1937894      IT
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [ ]:
df5['population'] - df5['GDP']

In [ ]:
df5

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [ ]:
df5['pop-GDP'] = df5['population'] - df5['GDP']
df5

          population      GDP alpha-2   pop-GDP
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

In [ ]:
aa = df5['population'] - df5['GDP']
df5['aa2'] = aa
df5

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df5['population']

Italy       59000000
France      65000000
Malta         434000
Maldives      434000
Brunei        434000
Iceland       337000
Nauru          11300
Tuvalu         11300
Anguilla       11300
Name: population, dtype: int64

In [ ]:
df5['population']//1000

Italy       59000
France      65000
Malta         434
Maldives      434
Brunei        434
Iceland       337
Nauru          11
Tuvalu         11
Anguilla       11
Name: population, dtype: int64

* 위와 같이 일률적으로 수식을 적용하는 것을 "브로드캐스팅"이라고 지칭

In [ ]:
df5

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df5 * 3

          population      GDP alpha-2    pop-GDP        aa2
Italy      177000000  5813682  ITITIT  171186318  171186318
France     195000000  7750680  FRFRFR  187249320  187249320
Malta        1302000    36033  MTMTMT    1265967    1265967
Maldives     1302000    13560  MVMVMV    1288440    1288440
Brunei       1302000    36384  BNBNBN    1265616    1265616
Iceland      1011000    51108  ISISIS     959892     959892
Nauru          33900      546  NRNRNR      33354      33354
Tuvalu         33900      114  TVTVTV      33786      33786
Anguilla       33900      933  AIAIAI      32967      32967

In [ ]:
df5

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df5.sort_index(ascending = True)

          population      GDP alpha-2   pop-GDP       aa2
Anguilla       11300      311      AI     10989     10989
Brunei        434000    12128      BN    421872    421872
France      65000000  2583560      FR  62416440  62416440
Iceland       337000    17036      IS    319964    319964
Italy       59000000  1937894      IT  57062106  57062106
Maldives      434000     4520      MV    429480    429480
Malta         434000    12011      MT    421989    421989
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262

In [ ]:
df6 = df5.sort_index(ascending = True)

In [ ]:
df5['GDP']

Italy       1937894
France      2583560
Malta         12011
Maldives       4520
Brunei        12128
Iceland       17036
Nauru           182
Tuvalu           38
Anguilla        311
Name: GDP, dtype: int64

In [ ]:
df6['GDP']

Anguilla        311
Brunei        12128
France      2583560
Iceland       17036
Italy       1937894
Maldives       4520
Malta         12011
Nauru           182
Tuvalu           38
Name: GDP, dtype: int64

In [ ]:
df5['GDP'] + df6['GDP']

Anguilla        622
Brunei        24256
France      5167120
Iceland       34072
Italy       3875788
Maldives       9040
Malta         24022
Nauru           364
Tuvalu           76
Name: GDP, dtype: int64

In [ ]:
df5['GDP']*2

Italy       3875788
France      5167120
Malta         24022
Maldives       9040
Brunei        24256
Iceland       34072
Nauru           364
Tuvalu           76
Anguilla        622
Name: GDP, dtype: int64

### 변수명.drop

In [ ]:
df5.drop?

Object `df5.drop` not found.

In [ ]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [ ]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [ ]:
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [ ]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [ ]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [ ]:
df6 = df5.copy()
df6

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df7 = df5
df7

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df7.drop(columns = ['pop-GDP'])

          population      GDP alpha-2       aa2
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

In [ ]:
df5=df7.drop(['pop-GDP'], axis=1)
df5

          population      GDP alpha-2       aa2
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

* df7.drop(['pop-GDP'])는 에러 남(인덱스에 'pop-GDP'가 없어서)

In [ ]:
df5 = df7.drop(['aa2'], axis = 1)
df5

          population      GDP alpha-2   pop-GDP
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

In [ ]:
df7

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

#### "Iceland"를 삭제하려면
* df7.drop(["Iceland"])
* df7.drop(index = "Iceland")
* df7.drop(["Iceland"], axis = 0)
* df7.drop("Iceland", axis = 0)
* 모두 가능
* * 행방향 이니까 index = 또는 axis = 0 또는 생략가능
* * 단일행이라서 [대괄호]로 감싸도 되고 안해도 되고)

In [ ]:
df7.drop(["Iceland"])

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df7.drop(index = "Iceland")

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df7.drop(["Iceland"], axis = 0)

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df7.drop("Iceland", axis = 0)

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [ ]:
df7.drop(['Italy', 'Malta'])

          population      GDP alpha-2
France      65000000  2583560      FR
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

### 시리즈의 연산

In [ ]:
age = pd.Series([37, 61, 90, 66, 56, 45, 41, 77])
age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
dtype: int64

In [ ]:
age + age

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
dtype: int64

In [ ]:
age.max()

90

In [ ]:
age.mean()

59.125

In [ ]:
age > age.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
dtype: bool

In [ ]:
age[age > age.mean()]

1    61
2    90
3    66
7    77
dtype: int64

In [ ]:
ex = pd.Series([1, 100])
ex

0      1
1    100
dtype: int64

In [ ]:
age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
dtype: int64

In [ ]:
age + ex

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

* 나머지 인덱스인 2~7은 계산할 수 없어서 NaN으로 처리 함

In [ ]:
rev_age = age.sort_index(ascending = False)

In [ ]:
age + rev_age

In [ ]:
age * 2

In [ ]:
age.drop(0)

In [ ]:
age.drop([1, 3, 5])